import pandas as pd
from excel_beautify import beautify_excel



def beautify_send(员工数据_result, 组长业绩_result, 主管业绩_reult, path):
    # 数据排序排版 +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ START ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
    员工输出数据 = 员工数据_result[
        ['group', '办公方式', '机构属性', 'director', '组长工号', 'team_leader', '员工工号', 'user_name', '是否新人', 'first_online_day',
         'dimission_date',
         '日均外呼次数', '日均通话时长', '应出勤天数', 'attendance_sum', 'newly_sum', 'old_sum', 'assign_sum', '申完量or放款量',
         '申完量排名or放款量排名',
         '申完量排名区间or放款量排名区间', '日均(申完量or放款量)', '日均(申完量or放款量)排名', '日均(申完量or放款量)排名区间', '申完率or放款率',
         '申完率排名or放款率排名', '申完率排名区间or放款率排名区间', '业绩是否达标']]

    员工输出数据.columns = ['业务组', '办公方式', '机构属性', '主管', '组长工号', '组长', '坐席工号', '坐席', '是否新人', '上线日期', '离职日期', '日均外呼次数',
                      '日均通话时长', '应出勤天数', '总上线天数', '新人天数', '老人天数', '分案数', '申完量or放款量', '申完量排名or放款量排名', '申完量排名区间or放款量排名区间',
                      '日均(申完量or放款量)', '日均(申完量or放款量)排名', '日均(申完量or放款量)排名区间', '申完率or放款率', '申完率排名or放款率排名',
                      '申完率排名区间or放款率排名区间', '业绩是否达标']

    组长输出数据 = 组长业绩_result[
        ['group', 'director', 'team_leader_no', 'team_leader', '总人数', '应达标人数', '达标人数', '离职人数', '流失率', '分案数', '申完数or放款数',
         '申完率or放款率', '申完率排名or放款率排名', '申完率排名区间or放款率区间', '日人均(申完数or放款数)', '日人均(申完数or放款数)排名', '日人均(申完数or放款数)排名区间',
         '小组总上线天数']]
    组长输出数据.columns = ['业务组', '主管', '组长工号', '组长', '坐席数', '应达标人数', '实际达标人数', '离职人数', '流失率', '分案数', '申完数or放款数', '申完率or放款率',
                      '申完率排名or放款率排名', '申完率排名区间or放款率区间', '日人均(申完数or放款数)', '日人均(申完数or放款数)排名', '日人均(申完数or放款数)排名区间',
                      '小组总上线天数']
    主管输出数据 = 主管业绩_reult[
        ['group', 'director_no', 'director', '总人数', '应达标人数', '达标人数', '离职人数', '流失率', '分案数', '放款数', '放款率', '带组数']]
    主管输出数据.columns = ['业务组', '主管工号', '主管', '坐席数', '应达标人数', '实际达标人数', '离职人数', '流失率', '分案数', '放款数', '放款率', '带组数']
    # 数据排序排版 +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ END ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
    ew = pd.ExcelWriter(path, engine='xlsxwriter')
    员工输出数据.to_excel(ew, sheet_name='坐席数据', index=False)
    组长输出数据.to_excel(ew, sheet_name='组长数据', index=False)
    主管输出数据.to_excel(ew, sheet_name='主管数据', index=False)
    ew.close()
    beautify_excel(path)
